/*
HOW TO ADD NEW MESSAGE:

Copy this:

{
  id: "msg-XXX",
  title: "",
  text: "Your message",
  media: [],
  createdAt: Date.now()
}

Then paste inside the array and edit.

Notes:
- media is optional
- you can add multiple media items
- leave media: [] if no media
*/

export const messages = [
  {
    id: "msg-010",
    title: "كوكو بيسلم عليكي 🐱",
    text: `موروو… 🐾

أنا كوكو

أنا مش بنسى اللي بيحبني

موروو تاني عشان في ناس مش بيسمعوا من أول مرة… 😾

— كوكو 🐾`,
    media: [
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080428/koko_tnxis4.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775082676/koko1_igtohy.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775082676/koko2_ytmzd8.jpg" },
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/q_auto/f_auto/v1775082711/kokoRain_zbxhub.mp4" },
    ],
    createdAt: new Date("2026-04-02").getTime()
  },
  {
    id: "msg-009",
    title: "السعاادة فى وجه اختي",
    text: `انتي عارفة إني بحب أشاركك أي حاجة بتبسطني، حتى لو كانت بسيطة…
النهارده جبت لهاجر مضرب نسكافيه كانت محتاجاه بقالها فترة،  😄
فجبتُهولها كدا على غفلة…
بصراحة فرحتها كانت حلوة أوي،
وحسيت إن الحاجات الصغيرة دي بتفرق أكتر ما إحنا متخيلين.
وحبيت أشاركك اللحظة دي…
عشان انتي أكتر حد بحب أحكيله وأنا مبسوط.
دودو كان مبسوط… وهو بيشوف حد بيحبه مبسوط 💙`,
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/q_auto/f_auto/v1775080413/HandheldMixer_p3w45e.mp4" }
    ],
    createdAt: new Date("2026-04-02").getTime()
  },
  {
    id: "msg-008",
    title: "فرحة ما شفتهاش منذ فترة",
    text:` مش عارف أشرحلك أنا مبسوط قد إيه وأنا بجهز الحاجات دي...

كل تفصيلة صغيرة كنت بعملها وأنا متخيل ابتسامتك،
وكنت بقول لنفسي: يا رب تفرح زي ما أنا فرحان دلوقتي.

أنا بجد سعيد... وسعادتي كلها مرتبطة بيكي،
ونفسي كل حاجة توصلك بنفس الإحساس ده.

أتمنى تكوني مبسوطة... زي ما دودو مبسوط وسعيد دلوقتي 😊💙`,
    media: [
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080428/withUrMug_pjjbkm.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080427/NoMoney_nihn6l.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080426/setup_calbkh.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080424/happy_dxtsvg.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080423/coffe_bgljdl.jpg" }
    ],
    createdAt: new Date("2026-04-2").getTime()
  },

  

    {
    id: "msg-007",
    title: "لست على ما يرام",
    text: "أنا لست على ما يرام يا مريم… \n \n أنا مش  كويس ... \n شوفت الريبوست قبل البلوك مرضيتش ابعت لسببين  \n بحاول اساعدك اننا نساعد بعض فى موضوع اننا منتكلمش وبردو عشان كلامك مع مامتك \n وكنت مستني اخلص شغل وهبقى ابعتلك \n اما انا ف هسيب الشغل كمان 10 ايام 😓",
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774819585/I_mTheProblem_kdajpw.mp4" },
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774819586/pain_wxgeit.mp4" },
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774819586/needU_qgipix.mp4" }
    ],
    createdAt: new Date("2026-03-29").getTime()
  },

  {
    id: "msg-006",
    title: "حتى يأذن لنا الله",
    text: "أمي النهاردة كانت حاسة بيا بشكل غريب… فضلت تبصلي وتسألني: مالك؟ \n حاولت أهرب من الكلام، بس مقدرتش… فحكيت لها كل حاجة.\n\nقالت لي: مش أنت كنت عايز الخطوة دي من بدري؟ كنت عايز الحلال؟\nقولتلها: آه… كنت عايز كدا من قلبي، بس مكنتش متخيل إن الطريق ليه هيبقى بالوجع دا.\n\nقولت لها إن أصعب حاجة مش القرار…\nأصعب حاجة إننا نبعد فجأة، بعد ما كنا كل حاجة لبعض.\n\nهي حاولت تهون عليا وقالت: متزعلش يا ابني، هي كدا بتحبك وبتخاف ربنا،\nبس رغم إني فاهم دا كويس… قلبي برضو تقيل.\n\nقولتلها: يا أمي أنا مش زعلان منها…\nأنا زعلان من إحساسي، من الفراغ اللي سابته، من إن في كلام كتير جوايا ومش عارف أقوله.\n\nبقيت ساكت كتير… مش عشان مفيش كلام،\nلكن عشان كل الكلام بيروح ناحيتها هي وبيرجعلي تاني من غير ما يوصل.\n\nوفي حاجة كمان اعترفت بيها لأول مرة…\nإني ساعات بخاف.\n\nبخاف إن الأيام تعدّي وتاخدني من ذاكرتك،\nأو إنك تكوني عرفتي تتخطي بسرعة وأنا لسه واقف مكاني.\n\nمش بلومك على دا… ولا حتى عايز أعرف إجابته،\nبس هو خوف جوايا بيظهر غصب عني.\n\nيمكن عشان أنا مش بعرف أعدّي بسهولة،\nأو عشان الحاجات اللي بحبها بتمسك فيا أكتر ما أنا بمسك فيها.\n\nقولتلها إني آخر حاجة قلتها لمريم،\nإني لما ربنا يأذن وييجي الوقت الصح، هكلمها،\nوقبل أي خطوة… هاخد رأيها هي الأول.\n\nلسه قدامي طريق طويل… وهي كمان،\nبس اللي متأكد منه إن اللي بيني وبينك عمره ما كان حاجة مؤقتة،\nولا إحساس وعدى… دا كان حقيقي، ولسه جوايا زي ما هو.\n\nأنا بحاول أكون قوي، وبحاول أعدي،\nبس الحقيقة… في ناس مفيش بديل ليهم مهما الوقت طال.\n\nولو في يوم حسّيتي إني سكت أو بعدت،\nفدا مش نسيان… دا عشان بحاول أحافظ على اللي باقي جوايا ليكي من غير ما أجرحه.\n\nأنا بفضفض معاكي زي ما اتعودت دايمًا،\nويمكن المرة دي هبعتلك “ضجيج عقل خالد” هنا،\nعشان واثق إنك هتقرأي الكلام دا بقلبك قبل عينيكي.\n\nفضفضتي مع أمي ريحتني شوية…\nبس برضو خلتني أعترف قدام نفسي إني موجوع أكتر ما كنت فاكر.\n\nادعي لي يا مريم…\nولو في لحظة عدت على بالك،\nافتكري إن في حد لسه شايلك جواه بكل هدوء… من غير ما يزعجك، بس عمره ما نسيك.",
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774700375/%D8%AD%D8%AA%D9%89_%D9%8A%D8%A3%D8%B0%D9%86_%D9%84%D9%86%D8%A7_%D8%A7%D9%84%D9%84%D9%87_tygrpx.mp4"}
    ],
    createdAt: new Date("2026-03-28").getTime(),
  },
  {
    id: "msg-005",
    title: "I will still want You ",
    text: " سأبقى أريدك لا يهمني كم سيكون الامر معقدا ",
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774477048/IStillWantU_znjm7u.mp4" }
    ],
    createdAt: new Date("2026-03-26").getTime(),
  },
  {
    id: "msg-004",
    title: "كلامك يتردد فى اذني",
    text: `كلامك و انتي بتطمني خالد ان ربنا هيستجيب لنا 
واني مقلقش و انك طمنتيني لما قولتي متقلقش يا خالد ما انت بتقيم الليل وبتدعي لينا و بتقول انك بتلاقي ربنا استجاب لك حتى لو بعد وقت 
قولتي وقتها جملة ثابتة فى قلبي قبل عقلي 
"مابالك يا خالد احنا الاتنين بندعي "
الجملة دي عاملة امان وطمأنينة و يقين غير طبيعي عندي 
احنا هندعي و انا هدعي وهنفضل كدا من بعيد لأن دا الافضل 
يا هنانا يسعدنا إن كنا من نصيب بعض 
و لو لقدر الله لم يكن هنبقى راضيين لأن اكيد ربنا شايف خير لينا فى موضوع تاني 
ربنا يجعلك من نصيبي.`,
    media: [],
    createdAt: new Date("2026-03-24").getTime(),
  },
  {
    id: "msg-003",
    title: "From My heart",
    text: `وَما زِلْتُ مَكاني أُحِبُّكَ مِن بَعِيدٍ 🙏💙
حَيْثُ لا مَعْصِيَةَ وَلا لِقاءَ
وَسَوْفَ أَبْقَى مُؤْمِنًا أَنِّي عِنْدَما أَلْقاكَ
سَتَكُونُ فِي قِمَّةِ النَّجاحِ`,
    media: [],
    createdAt: new Date("2026-03-23").getTime(),
  },
  {
    id: "msg-002",
    title: "For Meriam",
    text: `انت اكثر انسان بالدنيا يستاهل الفرح والخير لا تنسى ، لا تقصر بحق نفسك 
لا تسمع لاحد يقلل منك انت مختلف ونادر ويا بخت اللي يفوز بقلبك!
تمام؟`,
    media: [],
    createdAt: new Date("2026-03-22").getTime(),
  },
  {
    id: "msg-001",
    title: "رسالة… لمن يهمه الأمر",
    text: `هناك أشياء لا تنتهي حين نبتعد…
بل تتحول إلى دعاءٍ هادئ،
يُرفع في الخفاء، ويُترك أمره لله

لم يكن ما بيننا لحظة عابرة،
ولا كلماتٍ قيلت ثم ذهبت،
بل كان شيئًا صادقًا… كُتب بقلوبٍ لم تتعلم الكذب يومًا

ولذلك…
لم أعد أرى البُعد خسارة،
بل أراه اختيارًا صعبًا… فيه نجاة لنا،
وفيه محاولة صادقة أن نرضي الله قبل أي شيء

فأنا لم أتركك ضعفًا،
ولا نسيانًا،
بل تركتك لوجه الله،
وتركت ما في قلبي له،
فإن كان فيه خير… رده إلينا في الوقت الذي يرضيه

ولم يعد في قلبي خوف كما كان…
بل شيء واحد يتردد بداخلي بهدوء:

"وليغلبن لطفه خوفي"

ولذلك…
فإني أسأل الله بصدق،
وأتمنى من قلبي،
إن كان في اجتماعنا خير…
أن يجعل نصيبي معكِ،
وأن يجمع بيننا على ما يُرضيه

لا استعجالًا…
ولا تعلقًا يُرهق القلب،
بل دعاءً هادئًا…
يُترك أمره لله

فإن كان لنا نصيب…
فسيأتي دون أن نركض خلفه،
وسيُفتح له بابٌ بالحلال،
ويكون واضحًا، مطمئنًا، بلا خوف ولا قلق

وإن لم يكن…
فسأرضى،
لأنني أعلم أن الله لا يمنع عنا شيئًا إلا لأنه ليس لنا

ولهذا…
لن أتوقف عن الدعاء
ليس تمسكًا… بل يقينًا
أن الخير سيأتي في صورته الصحيحة

وأتمنى… إن مرّ هذا الكلام يومًا عليكِ
ألا تظني أنه انتظار أو ضغط،
بل هو دعاء هادئ… لا يُرهق أحدًا

فإن كان بيننا خير…
أسأل الله أن يجمعنا بطريقة ترضيه،
وأن يُسخّر لنا أهلنا،
وأن يكتب لنا ما فيه صلاح قلوبنا ودنيانا وآخرتنا

وإن لم يكن…
فسيظل لكِ في قلبي مكان طيب،
لا يؤلم… بل يبتسم كلما تذكّر

وسيظل الدعاء حاضرًا…
أن يحفظك الله،
وأن يطمئن قلبك،
وأن يكتب لكِ الخير حيث كان

وهذا المكان…
سيظل كما هو
لن يُحذف، ولن يُغلق

فإن أردتِ يومًا أن تعودي لتقرئي…
ستجدينه كما تركته

بعض الكلمات تُكتب من حين لآخر…
فاحتفظي به إن شئتِ…

(مش همسح الويبسايت ولا هوقفه ولا جه في بالي الفكرة دي دونت وري)
وبعدين يا عبيطة انتي اللي بينا اكتر من ويبسايت
احنا مش عشرة بس يومين
فبعض الأشياء لا تُترك للنسيان

وأنا…
سأمضي في طريقي،
أعمل على نفسي، وعلى مستقبلي،
وأحفظ قلبي لما كُتب له

فإن كان لكِ…
فسيصلك
وإن لم يكن…
فلن يضيع ما كان صادقًا يومًا

وفي كل الأحوال…
لن أنساك من دعائي
وربنا يجعلك من نصيبي
وهفضل على نفس عادتنا الدعاء لنا
واخراج الصداقات لنا مش هوقف ولا هبطل

وإن شاء الله ربنا يرزقنا كل خير

واستودعتكِ الله…
الذي لا تضيع ودائعه`,
    media: [],
    createdAt: new Date("2026-03-21").getTime(),
  }
];
