/*
HOW TO ADD NEW MESSAGE:

Copy this:

{
  id: "msg-XXX",
  title: "",
  text: "Your message",
  media: [],
  createdAt: Date.now()
}

Then paste inside the array and edit.

Notes:
- media is optional
- you can add multiple media items
- leave media: [] if no media
*/

export const messages = [
  
  {
    id: "msg-027",
    title: "peace",
    text: `لما ببقى تعبان  دائما بحب اسمع  قراّن بحب العادة دي فيا اوي وبطمن `,
    media: [{type:"video", url:"https://res.cloudinary.com/djdktudjh/video/upload/q_auto/f_auto/v1775597359/Qura_n_tjxtul.mp4", caption:"قرآن بصوت  الشيخ محمد صديق المنشاوي "}],
    createdAt: new Date("2026-04-08").getTime()
  },

  {
  id: "msg-026",
  title: "اطمني شوية ",
  text: "اطمني يا مريم الحمد لله يمكن دلوقت أحسن شوية عن الصبح بكتير بس بردو مش هروح امتحان بكرة لأن مذاكرتش و اخدت اذن تعويض \n صاحبي باسل جزاه الله كل خير اتكلم مع الادارة و اخدت موافقة تأجيل \n دعواتك فى اللي جاي ربنا يكرمني و يوفقني و ينجحني و يجبر بخاطري و يعوضني خير يارب العالمين \n ",
  media: [],
  createdAt: new Date("2026-04-08").getTime()
},

  {
  id: "msg-025",
  title: "بيقولوا النت هيقطع😱",
  text: "لما عرفت الخبر دا لو طلع حقيقة كدا هنتواصل حمام زاجل😂 \n نرجع للزمن القديم SMS 😂 \n ",
  media: [],
  createdAt: new Date("2026-04-08").getTime()
},

 {
  id: "msg-024",
  title: "بموت بالبطيئ",
  text: `دعواتك لي بالشفاء  😫
  بطني معدتي هتموتني من بعد العشاء امبارح و أنا تعبان اوي 😪 
  مقدرتش اروح امتحان النهاردة 😓
  و شكلي مش هقدر اروح امتحان بكرة بردو 😓
  ادعيلي بس ربنا يشفيني و يقومني بالسلامة عشان ورايا حاجات كتير اوي و مش عارف اعمل حاجة و انا تعبان كدة  🥺
  روحت المستشفى الصبح عشان احاول اعمل تقرير طبي و ختم النسر عشان الامتحان يتعوض ويموهم كان بسنة ومعملتش حاجة معاهم اخر ما زهقت لاني كنت تعبان روحت كدا كدا كنت هكشف فى عيادة خاصة 
  و خليت الدكتور يكتب لي تقرير طبي 
  عندي التهابات حادة فى الجهاز الهضمي + نزلة معوية حادة و ارتفاع بدرجة الحرارة  و اسهال 
  انا بجد محتاج كله يدعيلي 😓🥺
  تعبان جداً 😫 
  دعواتك لي بالشفاء يا حبيبتي  🥺 `,
  media: [],
  createdAt: new Date("2026-04-07").getTime()
},
 {
  id: "msg-023",
  title: "احكي يا مريم",
  text: `احكي يا مريم و فضفضي معايا 
  حاسس بيكي 😓🥺 
  كنت بصلي الفجر النهاردة وانا بدعيلك كنت زعلان عليكي والله لدرجة اني عيطت وانا بدعيلك 
  طمنيني عليكي `,
  media: [],
  createdAt: new Date("2026-04-05").getTime()
},
{
    id: "msg-022",
    title: "أنا جمبك 💙",
    text: `موري…
مش عارف ليه حاسس إن جواكي حاجة مزعلاكي، حتى لو بتقولي إنك كويسة…

أنا مش جاي أسألك ولا أضغط عليكي، بس جاي أقولك إنك مش لوحدك خالص…
أنا هنا جنبك، حتى لو من بعيد شوية، بس حاسس بيكي.

لو جواكي كلام ومش عارفة تقوليه… أنا أسمعه،
ولو مش عايزة تتكلمي دلوقتي… برضه تمام، خدي وقتك براحتك.

بس متشيليش كل ده لوحدك يا موري…
صدقيني حتى لو أنا ساكت، قلبي جنبك، وحاسس بكل حاجة جواكي.

تعالي كدا لحظة واهدي… وخدي نفس…
عميق هادئ كدا 
أنا هنا يا حبيبتي…
ولو احتجتيني، حتى من غير ما تقولي، دودو جنبك 💙`,
    media: [],
    createdAt: new Date("2026-04-04").getTime() 
  },
  {
    id: "msg-021",
    title: "دعوة فجر",
    text: `مع كل فجر جديد، في دعوة ليكِ بظهر الغيب.. إن ربنا يريح بالك ويشيل عنك أي حمل. خليكي قوية يا موري، واحنا سوا بطريقة ما.`,
    media: [{ type: "image", url: "/assets/messages/msg021.png" }],
    createdAt: new Date("2026-04-04").getTime()
  },
  {
    id: "msg-020",
    title: "أمانك عندي 💙",
    text: `كل اللي بتمناه إن ربنا يبارك في حياتك ويسعدك، ويجمعنا دايماً في الخير بطريقة ترضيه. أمانك وسعادتك هما اللي يهمني فوق أي حاجة.. زي ما الأغنية دي فيها شموخ وقدر، بدعيلك بكل خير.`,
    media: [{ type: "audio", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774620427/%D9%88%D9%84%D9%82%D8%AF_%D8%B0%D9%83%D8%B1%D8%AA%D9%83_%D9%88%D8%A7%D9%84%D8%B1%D9%85%D8%A7%D8%AD_%D9%86%D9%88%D8%A7%D9%87%D9%84_%D9%85%D9%86%D9%8A_e2c9rq.mp3" }],
    createdAt: new Date("2026-04-04").getTime()
  },
  {
    id: "msg-019",
    title: "ذي كل مرة أجيلك يا موري",
    text: `الأغنية دي بتلمس قلبي في كل مرة.. وبحس إنها بتعبر عن اللي جوايا ليكي بكل بساطة. اسمعيها بهدوء، واعرفي إن قلبي معاكِ.`,
    media: [
      { type: "audio", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774620440/Every_time_I_come_to_you_hi4pom.mp3" }
    ],
    createdAt: new Date("2026-04-04").getTime()
  },
  {
    id: "msg-018",
    title: "انتي عندي بالدنيا",
    text: `انتي بالنسبة لي دايمًا في المرتبة الأولى.. هدوئك وراحتك أهم من أي كلام. خدي وقتك يا مريم، ومكانك في قلبي دايمًا محفوظ بكل ود واحترام.. "أنت الحب" كله.`,
    media: [{ type: "audio", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774620429/anta-el-hob_pa2zwf.mp3" }],
    createdAt: new Date("2026-04-04").getTime()
  },
  {
    id: "msg-017",
    title: "كوني أنتي 💙",
    text: `لأني شايفك أجمل حد في الدنيا زي ما أنتي.. مش محتاجة تتغيري عشان حد. كوني أنتي يا مريم، وده كفاية أوي عشان قلبي يفضل يقدرك ويحترمك بكل هدوء.. "العيون دي" مشوفتش زيها.`,
    media: [{ type: "audio", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774620432/el-oyoun-di_szfwoa.mp3" }],
    createdAt: new Date("2026-04-04").getTime()
  },
  {
    id: "msg-016",
    title: "سكينة لقلبك",
    text: `خلي قلبك دايمًا متعلق بالسكينة.. السما دي واسعة أوي، وكرم ربنا أوسع. حبيت بس أطمن عليكي من بعيد لبعيد، وأبعتلك الصوت الهادي ده "بدون موسيقى" يونسك في هدوئك.`,
    media: [{ type: "audio", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774620447/%D8%B9%D8%A8%D8%AF%D8%A7%D9%84%D8%B1%D8%AD%D9%85%D9%86_%D9%85%D8%AD%D9%85%D8%AF_%D8%A8%D9%90%D8%B1%D9%88%D8%AD%D9%8A_%D9%81%D9%8E%D8%AA%D8%A7%D8%A9%D9%8C_%D9%85%D8%B9_%D8%A7%D9%84%D9%83%D9%84%D9%85%D8%A7%D8%AA_%D8%A8%D8%AF%D9%88%D9%86_%D9%85%D9%88%D8%B3%D9%8A%D9%82%D9%89_M4A_128K_h6lmnj.m4a" }],
    createdAt: new Date("2026-04-04").getTime()
  },
  {
    id: "msg-015",
    title: "فرحة قريبة",
    text: `إن شاء الله كل حاجة هتبقى أحسن.. لو حاسة بضيق دلوقتي، افتكري إن ربنا دايمًا بيفتح أبوابه، وبإذن الله "بشرانا اليوم" وكل يوم بالخير والراحة لقلبك.`,
    media: [{ type: "audio", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774620431/boshrak-elyoum_j55uq1.mp3" }],
    createdAt: new Date("2026-04-04").getTime()
  },
  {
    id: "msg-014",
    title: "لآخر العمر 💙",
    text: `زي ما الأغنية دي بتقول.. "سيرة الحب" بينا بتبدأ بقرار إننا نفضل جنب بعض في كل الحالات. هفضل ممتن لوجودك في حياتي، حتى لو في صمت. المهم عندي إنك تكوني بخير.`,
    media: [{ type: "audio", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774620470/siret-el-hob_gv2bhs.m4a" }],
    createdAt: new Date("2026-04-04").getTime()
  },

  { 
    id: "msg-013",
    title: "My Memory Box",
    text: `بصي بقى انا عامل بوكس كدا، بس هو مش مجرد بوكس وخلاص لا، ده فيه حتت مني انا بجد، حاجات يمكن صغيرة بس كل حاجة فيهم ليها معنى عندي.

كل تفصيلة جواه ليها حكاية، ذكرى، موقف، احساس عدى عليا وساب اثر، وانا بعمله كنت طول الوقت بتخيل اليوم اللي هقعد فيه معاكي وافتحه قدامك واحدة واحدة واحكيلك على كل حاجة فيه.

البوكس ده مرتبط بيا انا، بطريقتي، بحاجات محدش يشوفها غير لما يقرب بجد، وكنت دايما بتخيلك وانتي قاعدة قدامي بتسمعي وبتفهمي وبتضحكي على الحاجات الصغيرة اللي يمكن متبقاش مهمة لحد غيري.

وعندي يقين و مؤمن ان اليوم ده هييجي بإذن الله، اليوم اللي نقعد فيه سوا وكل حاجة تبقى ابسط واجمل لمجرد انك موجودة. 

مش مستعجل بس متأكد، ربنا هيجمعنا في وقت يكون هو الصح لينا.

لحد ما ده يحصل، البوكس مستني، وانا كمان.
😊🥺💙💙💙
Love U Mori`,
    media: [{type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775134256/MyMemoryBox_dz9omy.jpg" , caption: "My memory box , That I will share with U oneday ISA 🥺" }],
    createdAt: new Date("2026-04-02").getTime()
  },
  
  {
    id: "msg-012",
    title: "الشنطة   وصلت",
    text: `الشنطة وصلت يا مريومتي 💙 
    و ذي ماانت عارفة دودو بيحب يشاركك كل لحظاته االجميلة \n 
    الشنطة جميلة اوي وحلوة يا مريم 😊 \n 
     و اتمنى اان يومك كان سعيدامبارح و التهااردة و كل يوم   
     يا قدري و نصيبي و فرحتي و ضحكتي و كل حااجة حلوة فى حياتي   
     بحبك يا مريومتي  💙`,
    media: [
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775134258/Unboxing_w8oq7b.jpg" , caption: "الشنطة   وصلت" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775134252/Bag6_k2kiuc.jpg" , caption: "الشنطة   وصلت" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775134257/SafrCodeDetails_pexvno.jpg" , caption: "Saf Code Details  دا لو الشنطة لقدر الله ضاعت" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775134258/safeCode_cv7f9g.jpg" , caption: "qr code (For the safe code)" },
      
    ],
    createdAt: new Date("2026-04-02").getTime()
  },
  {
    id: "msg-011",
    title: "سيبت الشغل😊",
    text: `قدمت استقالتي امبارح و مشيت و حااسس براحة نفسية الى حد ماا دلوقت \n 
    و هبدأ اخطط وأركز فى اللي جي دعواتك يا اانسة مريم 
     واالحمد لله متيقن ان كدا كدا بتدعيلي 
     الميد الااسبوع اللي جي ان شاء الله 
     اتمنى يكون يومك  الااربعاء عدى على خير اان شاء الله 
     فى أمان الله💙💙💙`,
    media: [{ type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/q_auto/f_auto/v1775080408/I_mReady_rc79rn.mp4", muted: true }],
    createdAt: new Date("2026-04-02").getTime()
  },

  {
    id: "msg-010",
    title: "كوكو بيسلم عليكي 🐱",
    text: `موروو… 🐾

أنا كوكو

أنا مش بنسى اللي بيحبني

موروو تاني عشان في ناس مش بيسمعوا من أول مرة… 😾

— كوكو 🐾`,
    media: [
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080428/koko_tnxis4.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775082676/koko1_igtohy.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775082676/koko2_ytmzd8.jpg" },
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/q_auto/f_auto/v1775082711/kokoRain_zbxhub.mp4" },
    ],
    createdAt: new Date("2026-04-02").getTime()
  },
  {
    id: "msg-009",
    title: "السعاادة فى وجه اختي",
    text: `انتي عارفة إني بحب أشاركك أي حاجة بتبسطني، حتى لو كانت بسيطة…
النهارده جبت لهاجر مضرب نسكافيه كانت محتاجاه بقالها فترة،  😄
فجبتُهولها كدا على غفلة…
بصراحة فرحتها كانت حلوة أوي،
وحسيت إن الحاجات الصغيرة دي بتفرق أكتر ما إحنا متخيلين.
وحبيت أشاركك اللحظة دي…
عشان انتي أكتر حد بحب أحكيله وأنا مبسوط.
دودو كان مبسوط… وهو بيشوف حد بيحبه مبسوط 💙`,
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/q_auto/f_auto/v1775080413/HandheldMixer_p3w45e.mp4" }
    ],
    createdAt: new Date("2026-04-02").getTime()
  },
  {
    id: "msg-008",
    title: "فرحة ما شفتهاش منذ فترة",
    text:` مش عارف أشرحلك أنا مبسوط قد إيه وأنا بجهز الحاجات دي...

كل تفصيلة صغيرة كنت بعملها وأنا متخيل ابتسامتك،
وكنت بقول لنفسي: يا رب تفرح زي ما أنا فرحان دلوقتي.

أنا بجد سعيد... وسعادتي كلها مرتبطة بيكي،
ونفسي كل حاجة توصلك بنفس الإحساس ده.

أتمنى تكوني مبسوطة... زي ما دودو مبسوط وسعيد دلوقتي 😊💙`,
    media: [
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080428/withUrMug_pjjbkm.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080427/NoMoney_nihn6l.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080426/setup_calbkh.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080424/happy_dxtsvg.jpg" },
      { type: "image", url: "https://res.cloudinary.com/djdktudjh/image/upload/q_auto/f_auto/v1775080423/coffe_bgljdl.jpg" }
    ],
    createdAt: new Date("2026-04-2").getTime()
  },

  

    {
    id: "msg-007",
    title: "لست على ما يرام",
    text: "أنا لست على ما يرام يا مريم… \n \n أنا مش  كويس ... \n شوفت الريبوست قبل البلوك مرضيتش ابعت لسببين  \n بحاول اساعدك اننا نساعد بعض فى موضوع اننا منتكلمش وبردو عشان كلامك مع مامتك \n وكنت مستني اخلص شغل وهبقى ابعتلك \n اما انا ف هسيب الشغل كمان 10 ايام 😓",
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774819585/I_mTheProblem_kdajpw.mp4" },
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774819586/pain_wxgeit.mp4" },
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774819586/needU_qgipix.mp4" }
    ],
    createdAt: new Date("2026-03-29").getTime()
  },

  {
    id: "msg-006",
    title: "حتى يأذن لنا الله",
    text: "أمي النهاردة كانت حاسة بيا بشكل غريب… فضلت تبصلي وتسألني: مالك؟ \n حاولت أهرب من الكلام، بس مقدرتش… فحكيت لها كل حاجة.\n\nقالت لي: مش أنت كنت عايز الخطوة دي من بدري؟ كنت عايز الحلال؟\nقولتلها: آه… كنت عايز كدا من قلبي، بس مكنتش متخيل إن الطريق ليه هيبقى بالوجع دا.\n\nقولت لها إن أصعب حاجة مش القرار…\nأصعب حاجة إننا نبعد فجأة، بعد ما كنا كل حاجة لبعض.\n\nهي حاولت تهون عليا وقالت: متزعلش يا ابني، هي كدا بتحبك وبتخاف ربنا،\nبس رغم إني فاهم دا كويس… قلبي برضو تقيل.\n\nقولتلها: يا أمي أنا مش زعلان منها…\nأنا زعلان من إحساسي، من الفراغ اللي سابته، من إن في كلام كتير جوايا ومش عارف أقوله.\n\nبقيت ساكت كتير… مش عشان مفيش كلام،\nلكن عشان كل الكلام بيروح ناحيتها هي وبيرجعلي تاني من غير ما يوصل.\n\nوفي حاجة كمان اعترفت بيها لأول مرة…\nإني ساعات بخاف.\n\nبخاف إن الأيام تعدّي وتاخدني من ذاكرتك،\nأو إنك تكوني عرفتي تتخطي بسرعة وأنا لسه واقف مكاني.\n\nمش بلومك على دا… ولا حتى عايز أعرف إجابته،\nبس هو خوف جوايا بيظهر غصب عني.\n\nيمكن عشان أنا مش بعرف أعدّي بسهولة،\nأو عشان الحاجات اللي بحبها بتمسك فيا أكتر ما أنا بمسك فيها.\n\nقولتلها إني آخر حاجة قلتها لمريم،\nإني لما ربنا يأذن وييجي الوقت الصح، هكلمها،\nوقبل أي خطوة… هاخد رأيها هي الأول.\n\nلسه قدامي طريق طويل… وهي كمان،\nبس اللي متأكد منه إن اللي بيني وبينك عمره ما كان حاجة مؤقتة،\nولا إحساس وعدى… دا كان حقيقي، ولسه جوايا زي ما هو.\n\nأنا بحاول أكون قوي، وبحاول أعدي،\nبس الحقيقة… في ناس مفيش بديل ليهم مهما الوقت طال.\n\nولو في يوم حسّيتي إني سكت أو بعدت،\nفدا مش نسيان… دا عشان بحاول أحافظ على اللي باقي جوايا ليكي من غير ما أجرحه.\n\nأنا بفضفض معاكي زي ما اتعودت دايمًا،\nويمكن المرة دي هبعتلك “ضجيج عقل خالد” هنا،\nعشان واثق إنك هتقرأي الكلام دا بقلبك قبل عينيكي.\n\nفضفضتي مع أمي ريحتني شوية…\nبس برضو خلتني أعترف قدام نفسي إني موجوع أكتر ما كنت فاكر.\n\nادعي لي يا مريم…\nولو في لحظة عدت على بالك،\nافتكري إن في حد لسه شايلك جواه بكل هدوء… من غير ما يزعجك، بس عمره ما نسيك.",
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774700375/%D8%AD%D8%AA%D9%89_%D9%8A%D8%A3%D8%B0%D9%86_%D9%84%D9%86%D8%A7_%D8%A7%D9%84%D9%84%D9%87_tygrpx.mp4"}
    ],
    createdAt: new Date("2026-03-28").getTime(),
  },
  {
    id: "msg-005",
    title: "I will still want You ",
    text: " سأبقى أريدك لا يهمني كم سيكون الامر معقدا ",
    media: [
      { type: "video", url: "https://res.cloudinary.com/djdktudjh/video/upload/v1774477048/IStillWantU_znjm7u.mp4", muted: true }
    ],
    createdAt: new Date("2026-03-26").getTime(),
  },
  {
    id: "msg-004",
    title: "كلامك يتردد فى اذني",
    text: `كلامك و انتي بتطمني خالد ان ربنا هيستجيب لنا 
واني مقلقش و انك طمنتيني لما قولتي متقلقش يا خالد ما انت بتقيم الليل وبتدعي لينا و بتقول انك بتلاقي ربنا استجاب لك حتى لو بعد وقت 
قولتي وقتها جملة ثابتة فى قلبي قبل عقلي 
"مابالك يا خالد احنا الاتنين بندعي "
الجملة دي عاملة امان وطمأنينة و يقين غير طبيعي عندي 
احنا هندعي و انا هدعي وهنفضل كدا من بعيد لأن دا الافضل 
يا هنانا يسعدنا إن كنا من نصيب بعض 
و لو لقدر الله لم يكن هنبقى راضيين لأن اكيد ربنا شايف خير لينا فى موضوع تاني 
ربنا يجعلك من نصيبي.`,
    media: [],
    createdAt: new Date("2026-03-24").getTime(),
  },
  {
    id: "msg-003",
    title: "From My heart",
    text: `وَما زِلْتُ مَكاني أُحِبُّكَ مِن بَعِيدٍ 🙏💙
حَيْثُ لا مَعْصِيَةَ وَلا لِقاءَ
وَسَوْفَ أَبْقَى مُؤْمِنًا أَنِّي عِنْدَما أَلْقاكَ
سَتَكُونُ فِي قِمَّةِ النَّجاحِ`,
    media: [],
    createdAt: new Date("2026-03-23").getTime(),
  },
  {
    id: "msg-002",
    title: "For Meriam",
    text: `انت اكثر انسان بالدنيا يستاهل الفرح والخير لا تنسى ، لا تقصر بحق نفسك 
لا تسمع لاحد يقلل منك انت مختلف ونادر ويا بخت اللي يفوز بقلبك!
تمام؟`,
    media: [],
    createdAt: new Date("2026-03-22").getTime(),
  },
  {
    id: "msg-001",
    title: "رسالة… لمن يهمه الأمر",
    text: `هناك أشياء لا تنتهي حين نبتعد…
بل تتحول إلى دعاءٍ هادئ،
يُرفع في الخفاء، ويُترك أمره لله

لم يكن ما بيننا لحظة عابرة،
ولا كلماتٍ قيلت ثم ذهبت،
بل كان شيئًا صادقًا… كُتب بقلوبٍ لم تتعلم الكذب يومًا

ولذلك…
لم أعد أرى البُعد خسارة،
بل أراه اختيارًا صعبًا… فيه نجاة لنا،
وفيه محاولة صادقة أن نرضي الله قبل أي شيء

فأنا لم أتركك ضعفًا،
ولا نسيانًا،
بل تركتك لوجه الله،
وتركت ما في قلبي له،
فإن كان فيه خير… رده إلينا في الوقت الذي يرضيه

ولم يعد في قلبي خوف كما كان…
بل شيء واحد يتردد بداخلي بهدوء:

"وليغلبن لطفه خوفي"

ولذلك…
فإني أسأل الله بصدق،
وأتمنى من قلبي،
إن كان في اجتماعنا خير…
أن يجعل نصيبي معكِ،
وأن يجمع بيننا على ما يُرضيه

لا استعجالًا…
ولا تعلقًا يُرهق القلب،
بل دعاءً هادئًا…
يُترك أمره لله

فإن كان لنا نصيب…
فسيأتي دون أن نركض خلفه،
وسيُفتح له بابٌ بالحلال،
ويكون واضحًا، مطمئنًا، بلا خوف ولا قلق

وإن لم يكن…
فسأرضى،
لأنني أعلم أن الله لا يمنع عنا شيئًا إلا لأنه ليس لنا

ولهذا…
لن أتوقف عن الدعاء
ليس تمسكًا… بل يقينًا
أن الخير سيأتي في صورته الصحيحة

وأتمنى… إن مرّ هذا الكلام يومًا عليكِ
ألا تظني أنه انتظار أو ضغط،
بل هو دعاء هادئ… لا يُرهق أحدًا

فإن كان بيننا خير…
أسأل الله أن يجمعنا بطريقة ترضيه،
وأن يُسخّر لنا أهلنا،
وأن يكتب لنا ما فيه صلاح قلوبنا ودنيانا وآخرتنا

وإن لم يكن…
فسيظل لكِ في قلبي مكان طيب،
لا يؤلم… بل يبتسم كلما تذكّر

وسيظل الدعاء حاضرًا…
أن يحفظك الله،
وأن يطمئن قلبك،
وأن يكتب لكِ الخير حيث كان

وهذا المكان…
سيظل كما هو
لن يُحذف، ولن يُغلق

فإن أردتِ يومًا أن تعودي لتقرئي…
ستجدينه كما تركته

بعض الكلمات تُكتب من حين لآخر…
فاحتفظي به إن شئتِ…

(مش همسح الويبسايت ولا هوقفه ولا جه في بالي الفكرة دي دونت وري)
وبعدين يا عبيطة انتي اللي بينا اكتر من ويبسايت
احنا مش عشرة بس يومين
فبعض الأشياء لا تُترك للنسيان

وأنا…
سأمضي في طريقي،
أعمل على نفسي، وعلى مستقبلي،
وأحفظ قلبي لما كُتب له

فإن كان لكِ…
فسيصلك
وإن لم يكن…
فلن يضيع ما كان صادقًا يومًا

وفي كل الأحوال…
لن أنساك من دعائي
وربنا يجعلك من نصيبي
وهفضل على نفس عادتنا الدعاء لنا
واخراج الصداقات لنا مش هوقف ولا هبطل

وإن شاء الله ربنا يرزقنا كل خير

واستودعتكِ الله…
الذي لا تضيع ودائعه`,
    media: [],
    createdAt: new Date("2026-03-21").getTime(),
  }
];
